services/webscraping-manager/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."created_at" DESC  [["user_id", 1]]
---
  def index
    # Filtra as tarefas pelo user_id extraído do cookie JWT
    @tasks = Task.where(user_id: current_user_id).order(created_at: :desc)

INSERT INTO "tasks" ("title", "status", "url", "result", "error_message", "concluded_at", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @task = Task.new(task_params)
    @task.user_id = current_user_id
    @task.status = 'pending'

    if @task.save