services/auth-service/app/controllers/authentication_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "guilhermejno@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2026-02-22 20:47:22.769923"], ["updated_at", "2026-02-22 20:47:22.769923"]]
---
  def signup
    # Tenta pegar de dentro de :authentication ou direto do topo
    data = params[:authentication].present? ? auth_params : signup_params
    user = User.new(data)

    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "guilhermejno@gmail.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:email])