services/webscraping-manager/app/services/webmotors_scraper.rb

UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "processing"], ["updated_at", "2026-02-22 18:05:41.110060"], ["id", 7]]
UPDATE "tasks" SET "status" = $1, "error_message" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4
---
  def self.call(page, task)
    task.update(status: 'processing')

    begin
      puts "🕵️ Iniciando coleta de dados..."
      h1 = page.locator("#VehicleBasicInformationTitle")

      text = h1.text_content&.strip
      model = h1.locator("strong").text_content&.strip
      description = h1.locator("#VehicleBasicInformationDescription").text_content&.strip
      price = page.locator("#vehicleSendProposalPrice").text_content&.strip

      binding.pry
      brand = text.gsub(model, "").gsub(description, "").strip

      puts "🏎️ Marca: #{brand}"
      puts "🚘 Modelo: #{model}"

      data = {
        brand: brand,
        model: model,
        price: price
      }

      puts "✅ Dados coletados: #{data}"

      task.update!(
        result: data,
        status: 'completed',
        concluded_at: Time.current,
        title: "Coleta: #{data[:marca]} #{data[:modelo]}"
      )