services/webscraping-manager/app/services/webmotors_captcha_solver.rb

    task = Task.find(task_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

            puts "⚠️ Tentativa #{retries} falhou. Retentando..."
            retry
          end
          task.update(status: 'failed', error_message: "Não conseguiu vencer o Captcha após tentativas.") if retries >= 5
---
UPDATE "tasks" SET "status" = $1, "error_message" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["status", "failed"], ["error_message", "Não conseguiu vencer o Captcha após tentativas."], ["updated_at", "2026-02-23 02:32:26.543877"], ["id", 2]]

      end
    end
  rescue => e
    Task.find(task_id).update(status: 'failed', error_message: e.message)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "error_message" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["error_message", "closed stream"], ["updated_at", "2026-02-22 18:22:54.467343"], ["id", 10]]