services/webscraping-manager/app/workers/scrape_vehicles_worker.rb

INSERT INTO "tasks" ("title", "status", "url", "result", "error_message", "concluded_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    task = Task.create!(
      url: url,
      title: "BMW X2 - Pendente"
    )