services/webscraping-manager/app/workers/scrape_vehicles_worker.rb

    task = Task.find(task_id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]